# index
#  وهو يستخدم لاعادة مكان و رقم الكلمة في المصفوفة
# في حالة وجود اسماء متشابهية يعيد اول رقم فقط

emp = ['ahmed','mohammed','samer','reem','ahmed']
print(emp.index('samer'))
print(emp.index('ahmed'))
print('----------------------------------------------')

# count
# حيث يعيد هذا التابع عدد مرات التكرار للكلمة المدخلة

print(emp.count('ahmed'))
print(emp.count('samer'))
print('-------------------------------------------')

#copy
# يقوم هذا التابع بإنشاء نسخة طبق الاصل من قائمة اخري تابع المثال التالي

test = emp.copy()
print(emp)
print(test)

print('------------------------------------------------')
# clear
# يقوم هذا التابع بمسح محتويات القائمة تابع المثال التالي

print(emp)
emp.clear()
print(emp)