# sub
# تستخدم هذه الدالة في التاكد من التطابق و في نفس الوقت تبديل التطابق بشيء اخر
# عند استخدام هذه الدالة تاخذ 3 انماط
# النمط الاول: هو طريقة التعبير الذي نريده
# النمط الثاني : هو الجملة الجديدة التي نريد استبدالها
# النمط الثالث : هو كم عدد المرات التي تريد فيها الاستبدال واذا لم تكتبه سيقوم بتبديل كل الانماط المشابهه له

import re
string= 'hello my number is 458-789-1234 and my freind phone is 145-748-4567'
test_search = re.sub(r'\d{3}-\d{3}-\d{4}','458 789 1234',string , 1)
print(test_search)
print('--------------------------------------------------------------------------')

name = 'i am student at housob academy'
replace = re.sub('\s','-',name )
print(replace)
replace = re.sub('housob academy','housob-academy',name )
print(replace)
print('------------------------------------------------------')
#split
# تقوم هذه الدالة بتقطيع الجملة و تحويل كل كلمة الى قائمة
# النمط الاول: هو طريقة من اين يبدا التقطيع
# النمط الفعال : هو الجملة الجديدة التي نريد استبدالها
# يمكن تحديد عدد الكلمات اذا لم تكن تريد تغير جميع الكلامات

name = 'i am student at housob academy'
sp = re.split(r'\s',name)
print(sp)
sp = re.split(r'\s',name,4)
print(sp)
print('---------------------------------------------------')
#تمرين

name = 'نشاء-نظام-إدارة-موظفين-ومعالجة-البيانات-باستخدام-الإضافة'
replace = re.sub(r'-',' ',name)
print(replace)



