# upper
# يقوم هذا التابع بجعل الاحرف الصغيرة احرف كبيرة

test = 'hello ahmed'
print(test.upper())
print('____________________')
# lower
# يقوم هذا التابع بجعل الاحرف الكبيرة احرف صغيرة

test = 'HELOO AHMED'
print(test.lower())
print('--------------------')
# طريقة الدمج
test = test.upper()
print (test)


print('----------------')
# الفائدة من هاذين التوابع كل الاتي سنكتب مثال بدون التوابع ثم نكتب مثال بالتوابع و قرائة الفرق بينهم

# عند مراجعة هذا الدرس الغي الشرطات الاستعلامية لانه تم استخدامها لاكمال الدرس
'''
print ('كيف حالك')
feeling = input()
if feeling == 'great' :
    print('انا ايضا اشعر بشعور عظيم')
else:
    print('اتمني ان يكون باقي يومك جميل')
# هنا اذا قام المستخدم بكتابة الجواب great  باحرف كبيرة فسوف يفسر بايثون انها كلمة اخر
# ونقوم بعلاجة هذا الامر عن طريق التابعين باضافتهم مثل المثال الاتي
print('---------------------------')

print ('كيف حالك')
feeling = input()
if feeling.lower() == 'great':
    print('انا ايضا اشعر بشعور عظيم')
else:
    print('اتمني ان يكون باقي يومك جميل')
'''
print('------------------')
# islower , isupper
# هنا نقوم بالاستعلام عن هل هذه الاحرف كبير او هذه الاحرف صغيرة واجابة البرنامج تكون true , false كالمثال الاتي

test = 'Heloo Ahmed'
print(test.islower())

test = 'HELOO AHMED'
print(test.isupper())
print('--------------------------------------')
#title
# يقوم ه    ا التابع بتحويل السلسلة الى عنوان
# يكون العنوان في بايثون بداية كل كلمة حرف كبير و بعد كل رقم حرف كبير كالمثال الاتي

txt = 'my companey is alpha information technology in 60street'
print(txt.title())

print('-----------------------------------------')

#capitalize
# يقوم بجعل اول حرف فقط في السلسة الى حرف كبير و يجعل باقي السلة احرف صغيرة حتى لو مانت موجودة احرف كبيرة
# في المثال التالي جعلنا الحرف الاول صغير و بداية كل كلمة بعده كبيرة لنرى الفرق
txt = 'my companey is alpha Information Technology In 60Street'
print(txt.capitalize())

print('-----------------------------------------')
#swapcase
# يقوم هذا  التابع بتحويل الاحرف الكبيرة الى صغيرة و الاحرف الصغيرة الى كبيرة مثل المثال الاتي

txt = 'My Companey Is Alpha Information Technology In 60Street'
print(txt.swapcase())